#### Terraform Format Check 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_region.current: Reading...
data.aws_organizations_organization.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]
data.aws_caller_identity.current: Read complete after 0s [id=445567079474]
aws_s3_bucket.organisation_stacksets: Preparing import... [id=organisation-stacksets-445567079474]
aws_s3_object.terraform_remote_state: Preparing import... [id=organisation-stacksets-445567079474/terraform-remote-state.yaml]
aws_s3_bucket.organisation_stacksets: Refreshing state... [id=organisation-stacksets-445567079474]
aws_s3_object.terraform_remote_state: Refreshing state... [id=terraform-remote-state.yaml]
data.aws_organizations_organization.current: Read complete after 1s [id=o-hexz300bjw]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudformation_stack_set.terraform_remote_state will be created
  + resource "aws_cloudformation_stack_set" "terraform_remote_state" {
      + arn                 = (known after apply)
      + call_as             = "SELF"
      + capabilities        = [
          + "CAPABILITY_IAM",
          + "CAPABILITY_NAMED_IAM",
        ]
      + execution_role_name = (known after apply)
      + id                  = (known after apply)
      + name                = "terraform-remote-state"
      + parameters          = {
          + "GithubOrganisation" = "nvthvniel"
          + "GithubRepository"   = "aws-terraform"
        }
      + permission_model    = "SERVICE_MANAGED"
      + stack_set_id        = (known after apply)
      + tags_all            = {
          + "terraform" = "true"
        }
      + template_body       = (known after apply)
      + template_url        = "https://organisation-stacksets-445567079474.s3.eu-west-2.amazonaws.com/terraform-remote-state.yaml"

      + auto_deployment {
          + enabled                          = true
          + retain_stacks_on_account_removal = false
        }

      + operation_preferences {
          + failure_tolerance_count   = 1
          + max_concurrent_percentage = 100
        }
    }

  # aws_cloudformation_stack_set_instance.terraform_remote_state will be created
  + resource "aws_cloudformation_stack_set_instance" "terraform_remote_state" {
      + account_id               = (known after apply)
      + call_as                  = "SELF"
      + id                       = (known after apply)
      + organizational_unit_id   = (known after apply)
      + region                   = "eu-west-2"
      + retain_stack             = false
      + stack_id                 = (known after apply)
      + stack_instance_summaries = (known after apply)
      + stack_set_name           = "terraform-remote-state"

      + deployment_targets {
          + organizational_unit_ids = [
              + "r-t0l4",
            ]
        }
    }

  # aws_s3_bucket.organisation_stacksets will be imported
    resource "aws_s3_bucket" "organisation_stacksets" {
        acceleration_status         = null
        arn                         = "arn:aws:s3:::organisation-stacksets-445567079474"
        bucket                      = "organisation-stacksets-445567079474"
        bucket_domain_name          = "organisation-stacksets-445567079474.s3.amazonaws.com"
        bucket_prefix               = null
        bucket_regional_domain_name = "organisation-stacksets-445567079474.s3.eu-west-2.amazonaws.com"
        hosted_zone_id              = "Z3GKZC51ZF0DB4"
        id                          = "organisation-stacksets-445567079474"
        object_lock_enabled         = false
        policy                      = null
        region                      = "eu-west-2"
        request_payer               = "BucketOwner"
        tags                        = {}
        tags_all                    = {
            "terraform" = "true"
        }

        grant {
            id          = "fbbafde4d3582ecc05308f9bd09b9945519acaf529bb5755c0b3d8b9a8b6bba6"
            permissions = [
                "FULL_CONTROL",
            ]
            type        = "CanonicalUser"
            uri         = null
        }

        server_side_encryption_configuration {
            rule {
                bucket_key_enabled = true

                apply_server_side_encryption_by_default {
                    kms_master_key_id = null
                    sse_algorithm     = "AES256"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # aws_s3_object.terraform_remote_state will be updated in-place
  # (imported from "organisation-stacksets-445567079474/terraform-remote-state.yaml")
  ~ resource "aws_s3_object" "terraform_remote_state" {
        arn                           = "arn:aws:s3:::organisation-stacksets-445567079474/terraform-remote-state.yaml"
        bucket                        = "organisation-stacksets-445567079474"
        bucket_key_enabled            = false
        cache_control                 = null
        checksum_crc32                = null
        checksum_crc32c               = null
        checksum_sha1                 = null
        checksum_sha256               = null
        content_disposition           = null
        content_encoding              = null
        content_language              = null
        content_type                  = "application/x-yaml"
        etag                          = "75a70a472c0f92460beef56efcaa67ba"
      + force_destroy                 = false
        id                            = "terraform-remote-state.yaml"
        key                           = "terraform-remote-state.yaml"
        metadata                      = {}
        object_lock_legal_hold_status = null
        object_lock_mode              = null
        object_lock_retain_until_date = null
        server_side_encryption        = "AES256"
      + source                        = "templates/terraform-remote-state.yaml"
        storage_class                 = "STANDARD"
        tags                          = {}
        tags_all                      = {
            "terraform" = "true"
        }
      + version_id                    = (known after apply)
        website_redirect              = null
    }

Plan: 2 to import, 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```